src/Configuration/Documents/Премия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Премия</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Configuration/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Configuration/Documents/Премия/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнениеДанных(Команда)
	ПолучитьДанныеОПродажах();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеОПродажах();
	Запрос = Новый Запрос;
	
Запрос.Текст = "ВЫБРАТЬ
               |	ПродажиОбороты.Сотрудник КАК Сотрудник,
               |	ПродажиОбороты.СуммаОборот КАК СуммаОборот
               |ИЗ
               |	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Месяц, ) КАК ПродажиОбороты
               |
               |УПОРЯДОЧИТЬ ПО
               |	ПродажиОбороты.Сотрудник.Фамилия"  ;
    
Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.ПериодНачисления));      
Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодНачисления));
   ВидРасчета = ПланыВидовРасчета.Начисления.НайтиПоКоду("ППОП");  
   
       Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Объект.Начисления.Очистить();
                                                                                                                                             
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.Начисления.Добавить();
        
        НоваяСтрока.Сотрудник = Выборка.Сотрудник;
        НоваяСтрока.ВидРасчета = ВидРасчета;
        НоваяСтрока.ПоказательРасчета = Выборка.СуммаОборот;
        
    КонецЦикла;
    
  
КонецПроцедуры
